app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users".name ASC
---
  def index
  		#order users by name
  		@users = User.order(:name)

INSERT INTO "users" ("created_at", "hashed_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])